Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK1025SG01064.atdf
          <instance name="TCC6">
            <register-group name="TCC6" name-in-module="TCC" address-space="base" offset="0x4500C000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC01" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PC02" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="56" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="57" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="55" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="70" caption="Instance index for TCC6"/>
              <param name="MCLK_ID_APB" value="102" caption="Index for TCC6 APB clock"/>
              <param name="PAC_ID" value="70" caption="Index for TCC6 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC7">
            <register-group name="TCC7" name-in-module="TCC" address-space="base" offset="0x4500E000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB07" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PC03" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PB08" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PC04" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="59" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="60" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="58" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="32" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for TCC7"/>
              <param name="MCLK_ID_APB" value="103" caption="Index for TCC7 APB clock"/>
              <param name="PAC_ID" value="71" caption="Index for TCC7 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="TPIU" id="SYSTEM_IP" version="1.0.0">
          <instance name="TPIU">
            <register-group name="TPIU" name-in-module="TPIU" address-space="base" offset="0xE0040000"/>
          </instance>
        </module>
        <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x4401E000"/>
            <parameters>
              <param name="ADDR_MSB" value="7" caption="Value of the MSB bit of physical RAM address"/>
              <param name="INSTANCE_ID" value="15" caption="Instance index for TRAM"/>
              <param name="MCLK_ID_APB" value="47" caption="Index for TRAM APB clock"/>
              <param name="PAC_ID" value="15" caption="Index for TRAM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x45024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="82" caption="Instance index for TRNG"/>
              <param name="MCLK_ID_APB" value="112" caption="Index for TRNG APB clock"/>
              <param name="PAC_ID" value="82" caption="Index for TRNG registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="03613" name2="usb_u2222_v1" version="1d0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x4502A000"/>
            <signals>
              <signal group="DM" function="H" pad="PD03" ioset="1"/>
              <signal group="DP" function="H" pad="PD04" ioset="1"/>
              <signal group="SOF_1KHZ" function="H" pad="PC01" ioset="2"/>
              <signal group="SOF_1KHZ" function="H" pad="PD02" ioset="1"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32" caption="8, 16 or 32 : here, AHB transfer is made in word mode"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2" caption="as soon as there are N bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="DATA_BUS_16_8" value="0" caption="UTMI/SIE data bus size : 0 -&gt; 8 bits, 1 -&gt; 16 bits"/>
              <param name="EPNUM" value="8" caption="parameter for rtl : max of ENDPOINT and PIPE NUM"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="46" caption="Index of Generic Clock"/>
              <param name="INITIAL_CONTROL_QOS" value="3" caption="CONTROL QOS RESET value"/>
              <param name="INITIAL_DATA_QOS" value="3" caption="DATA QOS RESET value"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1" caption="48 mHz xPLL feature implemented"/>
              <param name="PIPE_NUM" value="8" caption="Number of USB pipes"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0" caption="Dual (1'b0) or Single (1'b1) clock system"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2" caption="as soon as there are 16 bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8" caption="8, 16 or 32 : here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="INSTANCE_ID" value="85" caption="Instance index for USB"/>
              <param name="MCLK_ID_AHB" value="19" caption="Index for USB AHB clock"/>
              <param name="MCLK_ID_APB" value="113" caption="Index for USB APB clock"/>
              <param name="PAC_ID" value="85" caption="Index for USB registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="USBHS" id="03787" name2="usb_otg_2_0_ctlr_v2" version="2a0">
          <instance name="USBHS">
            <register-group name="USBHS" name-in-module="USBHS" address-space="base" offset="0x46000000"/>
            <signals>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="97" caption="Instance index for USBHS"/>
              <param name="MCLK_ID_AHB" value="20" caption="Index for USBHS AHB clock"/>
              <param name="PAC_ID" value="97" caption="Index for USBHS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44016000"/>
            <parameters>
              <param name="FUSES_UPDATE_SUPPORT" value="0" caption="WDT Fuse Update Support"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for WDT"/>
              <param name="MCLK_ID_APB" value="43" caption="Index for WDT APB clock"/>
              <param name="PAC_ID" value="11" caption="Index for WDT registers write protection"/>
            </parameters>
          </instance>
        </module>
