Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK1025SG01064.atdf
        <register name="FUCFG12" offset="0x70" rw="RW" size="4" access-size="4" caption="IDAU_NONSECC">
          <bitfield name="BOOTROM_NONSECC" caption="BOOTROM NONSECC" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUCFG13" offset="0x74" rw="RW" size="4" access-size="4" caption="IDAU_NONSECAHB">
          <bitfield name="BOOTROM_NONSECAHB" caption="BOOTROM NONSECAHB" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUCFG14" offset="0x78" rw="RW" size="4" access-size="4" caption="PFM IDAU Configuration">
          <bitfield name="ANS" caption="Non-secure Flash application size" mask="0x1FF"/>
          <bitfield name="ANSC" caption="Non-secure callable Flash application size" mask="0x10000"/>
        </register>
        <register name="FUCFG15" offset="0x7C" rw="RW" size="4" access-size="4" caption="RAM IDAU Configuration">
          <bitfield name="RNS" caption="Non-secure RAM size" mask="0x7F"/>
        </register>
        <register name="FUCFG16" offset="0x80" rw="RW" size="4" access-size="4" caption="User Configuration 16 (HSM Firmware Metadata 0 Address)">
          <bitfield name="HSM_PTRMETA0" caption="HSM Firmware Metadata pointer 0" mask="0xFFFFFFFF"/>
        </register>
        <register name="FUCFG24" offset="0xA0" rw="RW" size="4" access-size="4" caption="User Configuration 24 (HSM Firmware Metadata 1 Address)">
          <bitfield name="HSM_PTRMETA1" caption="HSM Firmware Metadata pointer 1" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="BLDRCFG__BROM_EN_BFMCHK">
        <value name="NONE" caption="No verification" value="0x0"/>
        <value name="CRC32" caption="Verify using crc32" value="0x1"/>
      </value-group>
      <value-group name="DAL__CPU0">
        <value name="DAL0" caption="FCW_DAL0_VALUE" value="0x81"/>
        <value name="DAL1" caption="FCW_DAL1_VALUE" value="0x99"/>
        <value name="DAL2" caption="FCW_DAL2_VALUE" value="0xDB"/>
      </value-group>
      <value-group name="DAL__CPU1">
        <value name="DAL0" caption="FCW_DAL0_VALUE" value="0x81"/>
        <value name="DAL1" caption="FCW_DAL1_VALUE" value="0x99"/>
        <value name="DAL2" caption="FCW_DAL2_VALUE" value="0xDB"/>
      </value-group>
    </module>
    <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bit" mask="0x400"/>
          <bitfield name="GENCTRL9" caption="Generic Clock Generator Control 9 Synchronization Busy bit" mask="0x800"/>
          <bitfield name="GENCTRL10" caption="Generic Clock Generator Control 10 Synchronization Busy bit" mask="0x1000"/>
          <bitfield name="GENCTRL11" caption="Generic Clock Generator Control 11 Synchronization Busy bit" mask="0x2000"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="12" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="48" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GENCTRL__SRC">
        <value name="XOSC" caption="XOSC0 oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="4"/>
        <value name="DFLL" caption="DFLL output" value="5"/>
        <value name="PLL0_0" caption="Frac Divider PLL0 output 0" value="6"/>
        <value name="PLL0_1" caption="PLL0 output 1" value="7"/>
        <value name="PLL0_2" caption="PLL0 output 2" value="8"/>
        <value name="PLL0_3" caption="PLL0 output 3" value="9"/>
        <value name="PLL0_4" caption="PLL0 output 4" value="10"/>
        <value name="PLL0_5" caption="PLL0 output 5" value="11"/>
      </value-group>
      <value-group name="GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
      <value-group name="PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
        <value name="GCLK9" caption="Generic clock generator 9" value="0x9"/>
        <value name="GCLK10" caption="Generic clock generator 10" value="0xA"/>
        <value name="GCLK11" caption="Generic clock generator 11" value="0xB"/>
      </value-group>
    </module>
    <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0x3"/>
          <bitfield name="LQOSEN0" caption="Latency Quality Of Service Enable for Master 0" mask="0x4"/>
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0x30"/>
          <bitfield name="LQOSEN1" caption="Latency Quality Of Service Enable for Master 1" mask="0x40"/>
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0x300"/>
          <bitfield name="LQOSEN2" caption="Latency Quality Of Service Enable for Master 2" mask="0x400"/>
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0x3000"/>
          <bitfield name="LQOSEN3" caption="Latency Quality Of Service Enable for Master 3" mask="0x4000"/>
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0x30000"/>
          <bitfield name="LQOSEN4" caption="Latency Quality Of Service Enable for Master 4" mask="0x40000"/>
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0x300000"/>
          <bitfield name="LQOSEN5" caption="Latency Quality Of Service Enable for Master 5" mask="0x400000"/>
          <bitfield name="M6PR" caption="Master 6 Priority" mask="0x3000000"/>
          <bitfield name="LQOSEN6" caption="Latency Quality Of Service Enable for Master 6" mask="0x4000000"/>
          <bitfield name="M7PR" caption="Master 7 Priority" mask="0x30000000"/>
          <bitfield name="LQOSEN7" caption="Latency Quality Of Service Enable for Master 7" mask="0x40000000"/>
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
          <bitfield name="M8PR" caption="Master 8 Priority" mask="0x3"/>
          <bitfield name="LQOSEN8" caption="Latency Quality Of Service Enable for Master 8" mask="0x4"/>
          <bitfield name="M9PR" caption="Master 9 Priority" mask="0x30"/>
          <bitfield name="LQOSEN9" caption="Latency Quality Of Service Enable for Master 9" mask="0x40"/>
          <bitfield name="M10PR" caption="Master 10 Priority" mask="0x300"/>
          <bitfield name="LQOSEN10" caption="Latency Quality Of Service Enable for Master 10" mask="0x400"/>
          <bitfield name="M11PR" caption="Master 11 Priority" mask="0x3000"/>
          <bitfield name="LQOSEN11" caption="Latency Quality Of Service Enable for Master 11" mask="0x4000"/>
          <bitfield name="M12PR" caption="Master 12 Priority" mask="0x30000"/>
          <bitfield name="LQOSEN12" caption="Latency Quality Of Service Enable for Master 12" mask="0x40000"/>
          <bitfield name="M13PR" caption="Master 13 Priority" mask="0x300000"/>
          <bitfield name="LQOSEN13" caption="Latency Quality Of Service Enable for Master 13" mask="0x400000"/>
          <bitfield name="M14PR" caption="Master 14 Priority" mask="0x3000000"/>
          <bitfield name="LQOSEN14" caption="Latency Quality Of Service Enable for Master 14" mask="0x4000000"/>
          <bitfield name="M15PR" caption="Master 15 Priority" mask="0x30000000"/>
          <bitfield name="LQOSEN15" caption="Latency Quality Of Service Enable for Master 15" mask="0x40000000"/>
        </register>
      </register-group>
