Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/atdf/PIC32CK1025SG01064.atdf
        <register name="PHY08" offset="0x1508" rw="RW" size="4" initval="0x00000007" caption="USBHPHY Control Register.">
          <bitfield name="SQUELCH3" caption="MSB of Squelch configuration" mask="0x1"/>
          <bitfield name="RSVD" caption="Reserved" mask="0xFE"/>
        </register>
        <register name="PHY0C" offset="0x150C" rw="RW" size="4" initval="0x000000E0" caption="USBHPHY Control Register.">
          <bitfield name="TUNE210" caption="Lower 3 bits for HS amplitude tuning" mask="0xFE0"/>
        </register>
        <register name="PHY10" offset="0x1510" rw="RW" size="4" initval="0x000000AA" caption="USBHPHY Control Register.">
          <bitfield name="TUNE76543" caption="Upper 5 bits for HS amplitude tuning" mask="0x1F"/>
          <bitfield name="DRVTUNE210" caption="Lower 3 bits for HS/FS/LS driver strength tuning" mask="0xE0"/>
        </register>
        <register name="PHY14" offset="0x1514" rw="RW" size="4" initval="0x00000012" caption="USBHPHY Control Register.">
          <bitfield name="DRVTUNE43" caption="Upper 2 bits for HS/FS/LS driver strength tuning" mask="0x3"/>
          <bitfield name="COMPBYPSS" caption="Auto compensation bypass" mask="0xC"/>
          <bitfield name="BYPSSSQUELCH" caption="Bypass squelch trigger point configure in chirp mode" mask="0x10"/>
          <bitfield name="ODT0" caption="On die termination compensation voltage reference" mask="0x80"/>
        </register>
        <register name="PHY18" offset="0x1518" rw="RW" size="4" initval="0x00000008" caption="USBHPHY Control Register.">
          <bitfield name="ODT21" caption="Upper 3 bits for on die termination compensation voltage reference" mask="0x3"/>
          <bitfield name="RSVD" caption="reserved" mask="0x3C"/>
        </register>
        <register name="PHY1C" offset="0x151C" rw="RW" size="4" initval="0x00000082" caption="USBHPHY Control Register.">
          <bitfield name="ODTBYPASS" caption="ODT auto-refresh bypass" mask="0x2"/>
          <bitfield name="FSLSDIFF" caption="Turn off FS/LS differential receiver in suspend mode" mask="0x80"/>
        </register>
        <register name="PHY20" offset="0x1520" rw="RW" size="4" initval="0x00000080" caption="USBHPHY Control Register.">
          <bitfield name="RSVD" caption="Reserved" mask="0xF"/>
          <bitfield name="HSSLEW10" caption="Lower 2 bits for HS slew adjust rate" mask="0xC0"/>
        </register>
        <register name="PHY24" offset="0x1524" rw="RW" size="4" initval="0x0000000C" caption="USBHPHY Control Register.">
          <bitfield name="HSSLEW2" caption="MSB of HS slew rate adjust" mask="0x1"/>
          <bitfield name="VBUSDETEN" caption="VBUS Detection Switch 0 - Closed, 1 - Open" mask="0x2"/>
          <bitfield name="ENHLFBITPRE" caption="Enable half-bit pre-emphasis for HS transmit" mask="0x4"/>
          <bitfield name="HSPREEMPST" caption="HS transmit pre emphasis strength" mask="0x38"/>
          <bitfield name="HSDRIVST10" caption="HS transmit drive strength" mask="0xC0"/>
        </register>
        <register name="PHY28" offset="0x1528" rw="RW" size="4" initval="0x0000001B" caption="USBHPHY Control Register.">
          <bitfield name="HSDRIVST2" caption="MSB of HS transmit driver strength" mask="0x1"/>
          <bitfield name="DISCONDET" caption="HOST disconnects detection trigger point" mask="0x1E"/>
          <bitfield name="HSDRVCOMP" caption="HS drive current compensation voltage reference" mask="0xE0"/>
        </register>
        <register name="PHY44" offset="0x1544" rw="RW" size="4" initval="0x00000040" caption="USBHPHY Control Register.">
          <bitfield name="PLLDAMP" caption="PLL damping factor" mask="0x2"/>
          <bitfield name="DIGDBG" caption="Digital debug interface" mask="0x4"/>
          <bitfield name="FRCVBUSVAL" caption="Force output vbus_valid" mask="0x8"/>
          <bitfield name="RSVD" caption="reserved" mask="0x70"/>
          <bitfield name="FRCSESSEND" caption="force session end" mask="0x80"/>
        </register>
        <register name="PHY48" offset="0x1548" rw="RW" size="4" initval="0x00000004" caption="USBHPHY Control Register.">
          <bitfield name="FRCASESSVAL" caption="force A_sessionvalid" mask="0x1"/>
          <bitfield name="FRCBSESSVAL" caption="force B_sessionvalid" mask="0x2"/>
          <bitfield name="VBUSCHRGE" caption="VBus charging/discharging bypass" mask="0x4"/>
          <bitfield name="SESSENDTUNE" caption="Session end reference tuning" mask="0xE0"/>
        </register>
        <register name="PHY4C" offset="0x154C" rw="RW" size="4" initval="0x00000000" caption="USBHPHY Control Register.">
          <bitfield name="VBUSVALTUNE" caption="VBus_valid reference tuning" mask="0x7"/>
          <bitfield name="BSESSVALIDTUNE10" caption="Lower 2 B_sessionvalid reference tune" mask="0xC0"/>
        </register>
        <register name="PHY50" offset="0x1550" rw="RW" size="4" initval="0x00000000" caption="USBHPHY Control Register.">
          <bitfield name="BSESSVALIDTUNE2" caption="MSB of B_sessionvalid reference tune" mask="0x1"/>
          <bitfield name="ASESSVALIDTUNE" caption="A_sessionvalid reference tune" mask="0xE"/>
          <bitfield name="COMPCURREF" caption="Compensation current tuning reference" mask="0xE0"/>
        </register>
      </register-group>
      <value-group name="DMACNTL__DMADIR">
        <value name="WRITE" caption="DMA Write (RX Endpoint)" value="0x0"/>
        <value name="READ" caption="DMA Read (TX Endpoint)" value="0x1"/>
      </value-group>
      <value-group name="DMACNTL__DMAMODE">
        <value name="MODE0" caption="Mode 0 Transfer" value="0x0"/>
        <value name="MODE1" caption="Mode1 Transfer" value="0x1"/>
      </value-group>
      <value-group name="DMACNTL__DMABRSTM">
        <value name="BM0" caption="Burst Mode 0" value="0x0"/>
        <value name="BM1" caption="Burst Mode 1" value="0x1"/>
        <value name="BM2" caption="Burst Mode 2" value="0x2"/>
        <value name="BM3" caption="Burst Mode 3" value="0x3"/>
      </value-group>
